# Lab | Data Cleaning and Formatting

In this lab, we will be working with the customer data from an insurance company, which can be found in the CSV file located at the following link: https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv

# Challenge 1: Data Cleaning and Formatting

## Exercise 1: Cleaning Column Names

To ensure consistency and ease of use, standardize the column names of the dataframe. Start by taking a first look at the dataframe and identifying any column names that need to be modified. Use appropriate naming conventions and make sure that column names are descriptive and informative.

*Hint*:
- *Column names should be in lower case*
- *White spaces in column names should be replaced by `_`*
- *`st` could be replaced for `state`*

In [299]:
# Your code here
import pandas as pd
url = "https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv"
insurance_df = pd.read_csv(url)


insurance_df.rename(columns = {"ST":"state"}, inplace = True)

insurance_df.columns

Index(['Customer', 'state', 'GENDER', 'Education', 'Customer Lifetime Value',
       'Income', 'Monthly Premium Auto', 'Number of Open Complaints',
       'Policy Type', 'Vehicle Class', 'Total Claim Amount'],
      dtype='object')

In [300]:
insurance_df.rename(columns={col: col.replace(" ", "_").lower() for col in insurance_df.columns}, inplace=True)

insurance_df.columns

Index(['customer', 'state', 'gender', 'education', 'customer_lifetime_value',
       'income', 'monthly_premium_auto', 'number_of_open_complaints',
       'policy_type', 'vehicle_class', 'total_claim_amount'],
      dtype='object')

In [301]:
display(insurance_df)

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323
...,...,...,...,...,...,...,...,...,...,...,...
4003,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4004,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4005,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4006,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4007,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [302]:
insurance_df["gender"].unique()

array([nan, 'F', 'M', 'Femal', 'Male', 'female'], dtype=object)

## Exercise 2: Cleaning invalid Values

The dataset contains columns with inconsistent and incorrect values that could affect the accuracy of our analysis. Therefore, we need to clean these columns to ensure that they only contain valid data.

Note that this exercise will focus only on cleaning inconsistent values and will not involve handling null values (NaN or None).

*Hint*:
- *Gender column contains various inconsistent values such as "F", "M", "Femal", "Male", "female", which need to be standardized, for example, to "M" and "F".*
- *State abbreviations be can replaced with its full name, for example "AZ": "Arizona", "Cali": "California", "WA": "Washington"*
- *In education, "Bachelors" could be replaced by "Bachelor"*
- *In Customer Lifetime Value, delete the `%` character*
- *In vehicle class, "Sports Car", "Luxury SUV" and "Luxury Car" could be replaced by "Luxury"*

In [303]:
stand_gender = {"Male":"M", "m":"M", "M":"M", "F":"F", "female":"F", "Female":"F", "f":"F", "Femal":"F"}

insurance_df["gender"] = insurance_df["gender"].map(stand_gender).str.strip().str.upper()

insurance_df["gender"].unique()
insurance_df['state'].unique()

array(['Washington', 'Arizona', 'Nevada', 'California', 'Oregon', 'Cali',
       'AZ', 'WA', nan], dtype=object)

In [304]:
state_replacements = {
    "AZ": "Arizona",
    "Cali": "California",
    "WA": "Washington"
    # Add other states as needed
}

insurance_df['state'] = insurance_df['state'].map(state_replacements)
insurance_df['state'].unique()

array([nan, 'California', 'Arizona', 'Washington'], dtype=object)

In [305]:
# Standardizing the 'gender' column
#insurance_df['gender'] = insurance_df['gender'].str.strip().str.lower().replace({
 #   'male': 'M',
 ##   'm': 'M',
 #   'female': 'F',
 #   'f': 'F',
 #   'Femal': 'F'
#})

# Replacing state abbreviations with full names
#state_replacements = {
 #   "AZ": "Arizona",
 #   "Cali": "California",
  #  "WA": "Washington"
    # Add other states as needed
#}
#insurance_df['state'] = insurance_df['state'].replace(state_replacements)

# Standardizing the 'education' column
insurance_df['education'] = insurance_df['education'].str.replace('Bachelors', 'Bachelor', regex=False)

# Cleaning the 'customer_lifetime_value' column
insurance_df['customer_lifetime_value'] = insurance_df['customer_lifetime_value'].str.replace('%', '', regex=False).astype(float)

# Standardizing the 'vehicle_class' column
vehicle_class_replacements = {
    'Sports Car': 'Luxury',
    'Luxury SUV': 'Luxury',
    'Luxury Car': 'Luxury'
}
insurance_df['vehicle_class'] = insurance_df['vehicle_class'].replace(vehicle_class_replacements)

# Verify the changes
insurance_df.head()

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,NaN,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,NaN,F,Bachelor,697953.59,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,NaN,F,Bachelor,1288743.17,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,NaN,M,Bachelor,764586.18,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,NaN,M,High School or Below,536307.65,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

## Exercise 3: Formatting data types

The data types of many columns in the dataset appear to be incorrect. This could impact the accuracy of our analysis. To ensure accurate analysis, we need to correct the data types of these columns. Please update the data types of the columns as appropriate.

It is important to note that this exercise does not involve handling null values (NaN or None).

*Hint*:
- *Customer lifetime value should be numeric*
- *Number of open complaints has an incorrect format. Look at the different values it takes with `unique()` and take the middle value. As an example, 1/5/00 should be 5. Number of open complaints is a string - remember you can use `split()` to deal with it and take the number you need. Finally, since it should be numeric, cast the column to be in its proper type.*

In [306]:
insurance_df.select_dtypes(include='number')

,customer_lifetime_value,income,monthly_premium_auto,total_claim_amount
0,NaN,0.0,1000.0,2.704934
1,697953.59,0.0,94.0,1131.464935
2,1288743.17,48767.0,108.0,566.472247
3,764586.18,0.0,106.0,529.881344
4,536307.65,36357.0,68.0,17.269323
...,...,...,...,...
4003,NaN,NaN,NaN,NaN
4004,NaN,NaN,NaN,NaN
4005,NaN,NaN,NaN,NaN
4006,NaN,NaN,NaN,NaN
4007,NaN,NaN,NaN,NaN

In [307]:
# Your code here
insurance_df["customer_lifetime_value"] = insurance_df["customer_lifetime_value"].astype(float)

insurance_df["customer_lifetime_value"]
insurance_df.select_dtypes(include='number')

,customer_lifetime_value,income,monthly_premium_auto,total_claim_amount
0,NaN,0.0,1000.0,2.704934
1,697953.59,0.0,94.0,1131.464935
2,1288743.17,48767.0,108.0,566.472247
3,764586.18,0.0,106.0,529.881344
4,536307.65,36357.0,68.0,17.269323
...,...,...,...,...
4003,NaN,NaN,NaN,NaN
4004,NaN,NaN,NaN,NaN
4005,NaN,NaN,NaN,NaN
4006,NaN,NaN,NaN,NaN
4007,NaN,NaN,NaN,NaN

In [308]:
insurance_df["number_of_open_complaints"].unique()

array(['1/0/00', '1/2/00', '1/1/00', '1/3/00', '1/5/00', '1/4/00', nan],
      dtype=object)

In [309]:
insurance_df.select_dtypes(include='object')

,customer,state,gender,education,number_of_open_complaints,policy_type,vehicle_class
0,RB50392,NaN,NaN,Master,1/0/00,Personal Auto,Four-Door Car
1,QZ44356,NaN,F,Bachelor,1/0/00,Personal Auto,Four-Door Car
2,AI49188,NaN,F,Bachelor,1/0/00,Personal Auto,Two-Door Car
3,WW63253,NaN,M,Bachelor,1/0/00,Corporate Auto,SUV
4,GA49547,NaN,M,High School or Below,1/0/00,Personal Auto,Four-Door Car
...,...,...,...,...,...,...,...
4003,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4004,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4005,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4006,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4007,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [310]:
all(insurance_df["number_of_open_complaints"].apply(lambda x: isinstance(x, str)))

False

In [311]:
insurance_df["number_of_open_complaints"].apply(lambda x: type(x)).value_counts()

<class 'float'>    2937
<class 'str'>      1071
Name: number_of_open_complaints, dtype: int64

In [312]:
insurance_df["number_of_open_complaints"] = insurance_df["number_of_open_complaints"].astype(str)

In [313]:
insurance_df["number_of_open_complaints"] = insurance_df["number_of_open_complaints"].apply(lambda x: x.split("/")[1] if "/" in x else x)
insurance_df["number_of_open_complaints"].unique()

array(['0', '2', '1', '3', '5', '4', 'nan'], dtype=object)

In [314]:
insurance_df["number_of_open_complaints"].isna().sum()

0

In [315]:

#insurance_df["number_of_open_complaints"] = insurance_df["number_of_open_complaints"].apply(lambda x: x.astype(int) if x != 'nan' else x)

## Exercise 4: Dealing with Null values

Identify any columns with null or missing values. Identify how many null values each column has. You can use the `isnull()` function in pandas to find columns with null values.

Decide on a strategy for handling the null values. There are several options, including:

- Drop the rows or columns with null values
- Fill the null values with a specific value (such as the column mean or median for numerical variables, and mode for categorical variables)
- Fill the null values with the previous or next value in the column
- Fill the null values based on a more complex algorithm or model (note: we haven't covered this yet)

Implement your chosen strategy to handle the null values. You can use the `fillna()` function in pandas to fill null values or `dropna()` function to drop null values.

Verify that your strategy has successfully handled the null values. You can use the `isnull()` function again to check if there are still null values in the dataset.

Remember to document your process and explain your reasoning for choosing a particular strategy for handling null values.

After formatting data types, as a last step, convert all the numeric variables to integers.

In [316]:
insurance_df

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,NaN,NaN,Master,NaN,0.0,1000.0,0,Personal Auto,Four-Door Car,2.704934
1,QZ44356,NaN,F,Bachelor,697953.59,0.0,94.0,0,Personal Auto,Four-Door Car,1131.464935
2,AI49188,NaN,F,Bachelor,1288743.17,48767.0,108.0,0,Personal Auto,Two-Door Car,566.472247
3,WW63253,NaN,M,Bachelor,764586.18,0.0,106.0,0,Corporate Auto,SUV,529.881344
4,GA49547,NaN,M,High School or Below,536307.65,36357.0,68.0,0,Personal Auto,Four-Door Car,17.269323
...,...,...,...,...,...,...,...,...,...,...,...
4003,NaN,NaN,NaN,NaN,NaN,NaN,NaN,nan,NaN,NaN,NaN
4004,NaN,NaN,NaN,NaN,NaN,NaN,NaN,nan,NaN,NaN,NaN
4005,NaN,NaN,NaN,NaN,NaN,NaN,NaN,nan,NaN,NaN,NaN
4006,NaN,NaN,NaN,NaN,NaN,NaN,NaN,nan,NaN,NaN,NaN
4007,NaN,NaN,NaN,NaN,NaN,NaN,NaN,nan,NaN,NaN,NaN

In [317]:
# Your code here
insurance_df.isna().sum()

customer                     2937
state                        3833
gender                       3054
education                    2937
customer_lifetime_value      2940
income                       2937
monthly_premium_auto         2937
number_of_open_complaints       0
policy_type                  2937
vehicle_class                2937
total_claim_amount           2937
dtype: int64

In [320]:
insurance_df["gender"].isna().sum()

3054

In [326]:
#insurance_df.dropna(subset = ["gender"], inplace = True)
import numpy as np
num_nan = insurance_df['gender'].isna().sum() # Calculate the number of NaN values in the 'Sex' column


if num_nan == 3054:
    num_male = num_nan // 2
    num_female = num_nan - num_male  # In case the number is odd, give the extra one to 'F'


    replacement_values = ['M'] * num_male + ['F'] * num_female #Create a list with 'M' and 'F' values
    np.random.shuffle(replacement_values)    # Shuffle the list to randomize the distribution
    insurance_df.loc[insurance_df['gender'].isna(), 'gender'] = replacement_values  #  Replace NaN values in the 'Sex' column with the shuffled 'M' and 'F' values

# Display the first few rows to verify

#print("Number of Male (M):", (insurance_df['gender'] == 'M').sum())
#print("Number of Female (F):", (insurance_df['gender'] == 'F').sum())

insurance_df["gender"].isna().sum()
insurance_df["gender"].value_counts()

#distributing Nan between F and M, because removing all rows is too much

F    563
M    508
Name: gender, dtype: int64

In [318]:
insurance_df["customer"].unique()

array(['RB50392', 'QZ44356', 'AI49188', ..., 'CW49887', 'MY31220', nan],
      dtype=object)

In [324]:
insurance_df.dropna(subset = ["customer"], inplace = True)
insurance_df.isna().sum()
#dropping because has the same number of Nan as the majority of other columns (not losing any important info in other columns)

customer                       0
state                        896
gender                         0
education                      0
customer_lifetime_value        3
income                         0
monthly_premium_auto           0
number_of_open_complaints      0
policy_type                    0
vehicle_class                  0
total_claim_amount             0
dtype: int64

In [325]:
insurance_df

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,NaN,F,Master,NaN,0.0,1000.0,0,Personal Auto,Four-Door Car,2.704934
1,QZ44356,NaN,F,Bachelor,697953.59,0.0,94.0,0,Personal Auto,Four-Door Car,1131.464935
2,AI49188,NaN,F,Bachelor,1288743.17,48767.0,108.0,0,Personal Auto,Two-Door Car,566.472247
3,WW63253,NaN,M,Bachelor,764586.18,0.0,106.0,0,Corporate Auto,SUV,529.881344
4,GA49547,NaN,M,High School or Below,536307.65,36357.0,68.0,0,Personal Auto,Four-Door Car,17.269323
...,...,...,...,...,...,...,...,...,...,...,...
1066,TM65736,NaN,M,Master,305955.03,38644.0,78.0,1,Personal Auto,Four-Door Car,361.455219
1067,VJ51327,California,F,High School or Below,2031499.76,63209.0,102.0,2,Personal Auto,SUV,207.320041
1068,GS98873,NaN,F,Bachelor,323912.47,16061.0,88.0,0,Personal Auto,Four-Door Car,633.600000
1069,CW49887,NaN,F,Master,462680.11,79487.0,114.0,0,Special Auto,SUV,547.200000
1070,MY31220,NaN,F,College,899704.02,54230.0,112.0,0,Personal Auto,Two-Door Car,537.600000

In [330]:
insurance_df["customer_lifetime_value"].isna().sum()

3

In [333]:
insurance_df["customer_lifetime_value"] = insurance_df["customer_lifetime_value"].fillna(insurance_df["customer_lifetime_value"].mean())
insurance_df["customer_lifetime_value"].isna().sum()
#removing only 3 NaN

0

In [328]:
insurance_df["state"].value_counts()

California    120
Washington     30
Arizona        25
Name: state, dtype: int64

In [334]:
insurance_df["state"].isna().sum()

#too many Nan to drop

896

In [337]:
insurance_df["state"] = insurance_df["state"].fillna (method = "ffill")
insurance_df["state"].value_counts()

Arizona       440
California    358
Washington    256
Name: state, dtype: int64

In [346]:
insurance_df["state"] = insurance_df["state"].fillna (method = "bfill")

insurance_df["state"].isna().sum()

0

## Exercise 5: Dealing with duplicates

Use the `.duplicated()` method to identify any duplicate rows in the dataframe.

Decide on a strategy for handling the duplicates. Options include:
- Dropping all duplicate rows
- Keeping only the first occurrence of each duplicated row
- Keeping only the last occurrence of each duplicated row
- Dropping duplicates based on a subset of columns
- Dropping duplicates based on a specific column

Implement your chosen strategy using the `drop_duplicates()` function.

Verify that your strategy has successfully handled the duplicates by checking for duplicates again using `.duplicated()`.

Remember to document your process and explain your reasoning for choosing a particular strategy for handling duplicates.

Save the cleaned dataset to a new CSV file.

*Hint*: *after dropping duplicates, reset the index to ensure consistency*.

In [347]:
insurance_df

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,California,F,Master,7.936903e+05,0.0,1000.0,0,Personal Auto,Four-Door Car,2.704934
1,QZ44356,California,F,Bachelor,6.979536e+05,0.0,94.0,0,Personal Auto,Four-Door Car,1131.464935
2,AI49188,California,F,Bachelor,1.288743e+06,48767.0,108.0,0,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,7.645862e+05,0.0,106.0,0,Corporate Auto,SUV,529.881344
4,GA49547,California,M,High School or Below,5.363077e+05,36357.0,68.0,0,Personal Auto,Four-Door Car,17.269323
...,...,...,...,...,...,...,...,...,...,...,...
1066,TM65736,California,M,Master,3.059550e+05,38644.0,78.0,1,Personal Auto,Four-Door Car,361.455219
1067,VJ51327,California,F,High School or Below,2.031500e+06,63209.0,102.0,2,Personal Auto,SUV,207.320041
1068,GS98873,California,F,Bachelor,3.239125e+05,16061.0,88.0,0,Personal Auto,Four-Door Car,633.600000
1069,CW49887,California,F,Master,4.626801e+05,79487.0,114.0,0,Special Auto,SUV,547.200000
1070,MY31220,California,F,College,8.997040e+05,54230.0,112.0,0,Personal Auto,Two-Door Car,537.600000

In [349]:
insurance_df.duplicated().any()

False

In [348]:
# Your code here
#df_without_duplicates = df.drop_duplicates(subset=['vehicle_class'])
insurance_df.duplicated(subset=['customer']).sum()

#This is the only column in which having repeated values would matter, because each value has to be unique.

0

# Bonus: Challenge 2: creating functions on a separate `py` file

Put all the data cleaning and formatting steps into functions, and create a main function that performs all the cleaning and formatting.

Write these functions in separate .py file(s). By putting these steps into functions, we can make the code more modular and easier to maintain.

*Hint: autoreload module is a utility module in Python that allows you to automatically reload modules in the current session when changes are made to the source code. This can be useful in situations where you are actively developing code and want to see the effects of changes you make without having to constantly restart the Python interpreter or Jupyter Notebook kernel.*

In [ ]:
# Your code here

# Bonus: Challenge 3: Analyzing Clean and Formated Data

You have been tasked with analyzing the data to identify potential areas for improving customer retention and profitability. Your goal is to identify customers with a high policy claim amount and a low customer lifetime value.

In the Pandas Lab, we only looked at high policy claim amounts because we couldn't look into low customer lifetime values. If we had tried to work with that column, we wouldn't have been able to because customer lifetime value wasn't clean and in its proper format. So after cleaning and formatting the data, let's get some more interesting insights!

Instructions:

- Review the statistics again for total claim amount and customer lifetime value to gain an understanding of the data.
- To identify potential areas for improving customer retention and profitability, we want to focus on customers with a high policy claim amount and a low customer lifetime value. Consider customers with a high policy claim amount to be those in the top 25% of the total claim amount, and clients with a low customer lifetime value to be those in the bottom 25% of the customer lifetime value. Create a pandas DataFrame object that contains information about customers with a policy claim amount greater than the 75th percentile and a customer lifetime value in the bottom 25th percentile.
- Use DataFrame methods to calculate summary statistics about the high policy claim amount and low customer lifetime value data. To do so, select both columns of the dataframe simultaneously and pass it to the `.describe()` method. This will give you descriptive statistics, such as mean, median, standard deviation, minimum and maximum values for both columns at the same time, allowing you to compare and analyze their characteristics.

In [ ]:
# Your code here